#include <stdio.h>

int main(void)
{
	int i, j;
	
	int arr1[3][3] = {1, 2, 3, 4, 5, 6, 7, 8, 9};
	int (*ptr1)[3] = arr1;
	
	for(i=0; i<3; i++){
		printf("%d %d %d\n", ptr1[i][0], ptr1[i][1], ptr1[i][2]);
	}
	
	int arr2[4][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16};
	int (*ptr2)[3] = arr2; // 경고 발생
	/*
	원하는것은 다음행(16바이트)이나
	(*ptr2)[3]으로 선언시 ptr2+1은 ptr2에서 다음(12바이트)임
	(*ptr2)[3]일때
	*ptr2=1, *ptr2+1=4, *ptr2+2=7, *ptr2+3=10으로 배열의 3칸씩 건너감
	
	따라서 1234, ...., 13141516출력 되야할것이
	'1'234, '4'567, '7'8910, '10'111213으로 출력됨
	*/
	
	for(i=0; i<4; i++){
		printf("%d %d %d %d \n", ptr2[i][0], ptr2[i][1], ptr2[i][2], ptr2[i][3]);
	}
	// 위아래는 같은표현
	for(i=0; i<4; i++){
		printf("%d %d %d %d \n", (*(ptr2+i))[0], (*(ptr2+i))[1], (*(ptr2+i))[2], (*(ptr2+i))[3]);
	}
	
}